create_clock -period 0.03 -name clk

set_input_delay  0 -clock clk pi14 
set_input_delay  0 -clock clk pi06 
set_input_delay  0 -clock clk pi21 
set_input_delay  0 -clock clk pi12 
set_input_delay  0 -clock clk pi09 
set_input_delay  0 -clock clk pi18 
set_input_delay  0 -clock clk pi17 
set_input_delay  0 -clock clk pi16 
set_input_delay  0 -clock clk pi20 
set_input_delay  0 -clock clk pi11 
set_input_delay  0 -clock clk pi19 
set_input_delay  0 -clock clk pi28 
set_input_delay  0 -clock clk pi00 
set_input_delay  0 -clock clk pi02 
set_input_delay  0 -clock clk pi35 
set_input_delay  0 -clock clk pi31 
set_input_delay  0 -clock clk pi07 
set_input_delay  0 -clock clk pi08 
set_input_delay  0 -clock clk pi25 
set_input_delay  0 -clock clk pi15 
set_input_delay  0 -clock clk pi22 
set_input_delay  0 -clock clk pi34 
set_input_delay  0 -clock clk pi04 
set_input_delay  0 -clock clk pi27 
set_input_delay  0 -clock clk pi01 
set_input_delay  0 -clock clk pi13 
set_input_delay  0 -clock clk pi29 
set_input_delay  0 -clock clk pi10 
set_input_delay  0 -clock clk pi33 
set_input_delay  0 -clock clk pi30 
set_input_delay  0 -clock clk pi24 
set_input_delay  0 -clock clk pi23 
set_input_delay  0 -clock clk pi32 
set_input_delay  0 -clock clk pi05 
set_input_delay  0 -clock clk pi03 
set_input_delay  0 -clock clk pi26 

set_max_delay  0.03 -to po3 
set_max_delay  0.03 -to po0 
set_max_delay  0.03 -to po5 
set_max_delay  0.03 -to po4 
set_max_delay  0.03 -to po6 
set_max_delay  0.03 -to po2 
set_max_delay  0.03 -to po1 
